# Brewfile - Generated from current Homebrew installation
# After filtering, run: brew bundle install
# To cleanup: brew bundle cleanup

# ============================================================================
# TAPS (Third-party repositories)
# ============================================================================
tap "crystal-ameba/ameba"
tap "d12frosted/emacs-plus"
tap "deskflow/tap"
tap "elixir-tools/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mattt/tap"
tap "mongodb/brew"
tap "pagerduty/pd_brews"
tap "rbenv/tap"
tap "wtfutil/wtfutil"

# ============================================================================
# FORMULAS (Command-line tools)
# ============================================================================

# --- Development Tools ---
brew "act"                              # Run GitHub Actions locally
brew "actionlint"                       # GitHub Actions workflow linter
brew "asdf"                             # Version manager for multiple languages
brew "autoconf"                         # Automatic configure script builder
brew "automake"                         # Tool for generating Makefile.in files
brew "cmake"                            # Cross-platform build system
brew "ctags", link: false               # Tags file generator
brew "editorconfig"                     # Maintain consistent coding styles
brew "editorconfig-checker"             # EditorConfig validator
brew "git"                              # Distributed version control
brew "git-delta"                        # Syntax-highlighting pager for git
brew "git-lfs"                          # Git extension for versioning large files
brew "gitleaks"                         # Scan git repos for secrets
brew "global"                           # Source code tagging system
brew "lazygit"                          # Terminal UI for git

# --- Shell & Terminal ---
brew "bash"                             # Bourne-Again SHell
brew "bash-completion"                  # Bash completion
brew "coreutils"                        # GNU File, Shell, and Text utilities
brew "dialog"                           # Display dialog boxes from shell scripts
brew "direnv"                           # Load/unload environment variables
brew "eza"                              # Modern replacement for ls
brew "fd"                               # Simple, fast alternative to find
brew "findutils"                        # GNU find, xargs, locate
brew "fzf"                              # Command-line fuzzy finder
brew "gawk"                             # GNU awk
brew "gnu-sed"                          # GNU implementation of sed
brew "gnu-tar"                          # GNU version of tar
brew "htop"                             # Improved top
brew "ripgrep"                          # Fast search tool (grep alternative)
brew "starship"                         # Cross-shell prompt
brew "tmux"                             # Terminal multiplexer
brew "watch"                            # Execute command periodically
brew "zoxide"                           # Smarter cd command
brew "zsh-autosuggestions"              # Fish-like autosuggestions for zsh
brew "zsh-history-substring-search"     # ZSH port of Fish history search
brew "zsh-syntax-highlighting"          # Fish-like syntax highlighting for zsh

# --- Text Processing & Editors ---
brew "bat"                              # Cat clone with syntax highlighting
brew "neovim"                           # Vim-fork focused on extensibility
brew "vim"                              # Vi IMproved
brew "dos2unix"                         # Convert DOS/Windows text to Unix
brew "discount"                         # C implementation of Markdown
brew "groff"                            # GNU troff text-formatting system
brew "pandoc"                           # Universal document converter

# --- Emacs & Language Servers ---
brew "aspell"                           # Spell checker (for Emacs)
brew "bash-language-server"             # Language server for Bash
brew "editorconfig"                     # EditorConfig support
brew "enchant"                          # Spellchecker abstraction library
brew "gnutls"                           # GNU TLS library (for Emacs)
brew "gopls"                            # Go language server
brew "graphviz"                         # Graph visualization software
brew "hunspell"                         # Spell checker (for Emacs)
brew "kotlin-language-server"           # Kotlin language server
brew "languagetool"                     # Grammar, style, and spell checker
brew "libgccjit"                        # JIT library for Emacs native-comp
brew "libvterm"                         # Terminal emulator library (for Emacs vterm)
brew "libxt"                            # X Toolkit library (for Emacs X support)
brew "libxslt"                          # XSLT C library
brew "marksman"                         # Markdown language server
brew "mu"                               # Email indexer for Emacs mu4e
brew "pinentry-mac"                     # Passphrase entry dialog for GPG
brew "poppler"                          # PDF rendering library (for Emacs pdf-tools)
brew "sql-language-server"              # SQL language server
brew "stylelint"                        # CSS linter
brew "yaml-language-server"             # YAML language server
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-c9rgreen-sonoma-icon", "with-dbus", "with-debug", "with-imagemagick", "with-mailutils", "with-xwidgets"]

# --- Programming Languages ---
brew "crystal"                          # Crystal language
brew "crystal-icr"                      # Crystal REPL
brew "crystalline"                      # Crystal language server
brew "elixir"                           # Elixir language
brew "elixir-ls"                        # Elixir language server
brew "erlfmt"                           # Erlang formatter
brew "gcc"                              # GNU compiler collection
brew "gdb"                              # GNU debugger
brew "go"                               # Go programming language
brew "leiningen"                        # Clojure build tool
brew "openjdk"                          # Java Development Kit
brew "php"                              # PHP scripting language
brew "python@3.13"                      # Python 3.13
brew "sbcl"                             # Steel Bank Common Lisp
brew "elixir-tools/tap/next-ls"         # Next generation Elixir language server

# --- Database Tools ---
brew "libpq"                            # PostgreSQL C API library
brew "mongodb-atlas-cli"                # MongoDB Atlas CLI
brew "mydumper"                         # MySQL backup tool
brew "mysql-client@5.7"                 # MySQL client 5.7
brew "mysql-client@8.0", link: true     # MySQL client 8.0
brew "postgresql@17"                    # PostgreSQL 17
brew "redis"                            # In-memory data structure store
brew "sqlfmt"                           # SQL formatter
brew "mongodb/brew/mongodb-database-tools"  # MongoDB database tools
brew "mongodb/brew/mongodb-community"   # MongoDB community server

# --- Cloud & DevOps ---
brew "ansible"                          # Configuration management
brew "argocd"                           # GitOps continuous delivery
brew "awscli"                           # AWS command-line interface
brew "docker-credential-helper"         # Docker credential helper
brew "docker-credential-helper-ecr"     # ECR credential helper
brew "doctl"                            # DigitalOcean CLI
brew "gh"                               # GitHub CLI
brew "gh-ost"                           # GitHub's online schema migration
brew "helm"                             # Kubernetes package manager
brew "kubernetes-cli"                   # Kubernetes command-line
brew "s3cmd"                            # S3 command-line tool
brew "saml2aws"                         # CLI for SAML-based AWS login
brew "tfenv"                            # Terraform version manager
brew "pagerduty/pd_brews/aws-okta"      # PagerDuty AWS Okta tool
brew "pagerduty/pd_brews/pd-aws"        # PagerDuty AWS tool
brew "pagerduty/pd_brews/pd-kubectx"    # PagerDuty kubectl context switcher
brew "pagerduty/pd_brews/pd-ssh"        # PagerDuty SSH tool

# --- Networking & Security ---
brew "autossh"                          # Automatically restart SSH sessions
brew "bettercap"                        # Network attack and monitoring
brew "curl"                             # Transfer data with URLs
brew "dnsmasq"                          # DNS forwarder and DHCP server
brew "gnupg"                            # GNU Privacy Guard
brew "hcxtools"                         # Portable solution for capturing wlan traffic
brew "httpie"                           # User-friendly HTTP client
brew "iperf"                            # Network bandwidth measurement
brew "lsusb"                            # List USB devices
brew "mosh"                             # Remote terminal with roaming
brew "nmap"                             # Network exploration tool
brew "ssh-copy-id"                      # Copy SSH public key
brew "sshuttle"                         # VPN over SSH
brew "telnet"                           # User interface to TELNET protocol
brew "trufflehog"                       # Find credentials in git repos
brew "wget"                             # Internet file retriever
brew "whois"                            # Lookup tool for domain names

# --- Security & Code Analysis ---
brew "semgrep"                          # Static analysis tool
brew "shellcheck"                       # Shell script analysis tool
brew "trufflehog"                       # Find credentials in git repos

# --- Media & Image Processing ---
brew "cairo"                            # 2D graphics library
brew "ffmpeg"                           # Video/audio processing
brew "ffmpegthumbnailer"                # Video thumbnail generator
brew "gifsicle"                         # GIF image manipulation
brew "ghostscript"                      # PostScript/PDF interpreter
brew "imagemagick"                      # Image manipulation
brew "jpeg-xl"                          # JPEG XL image codec
brew "harfbuzz"                         # Text shaping library
brew "librsvg"                          # SVG rendering library
brew "libwebm"                          # WebM video format library
brew "media-info"                       # Media file information tool
brew "sox"                              # Sound processing
brew "tesseract"                        # OCR engine
brew "viu"                              # Terminal image viewer
brew "yt-dlp"                           # YouTube downloader

# --- Documentation & Publishing ---
brew "doxygen"                          # Documentation generator
brew "fop"                              # XSL-FO print formatter
brew "gnuplot"                          # Graph plotting
brew "hugo"                             # Static site generator
brew "lynx"                             # Text-based web browser
brew "ocrmypdf"                         # Add OCR layer to PDFs
brew "weasyprint"                       # PDF generator

# --- Utilities ---
brew "clang-format"                     # C/C++/Obj-C formatter
brew "cowsay"                           # Configurable talking cow
brew "jq"                               # JSON processor
brew "mas"                              # Mac App Store CLI
brew "p7zip"                            # 7-Zip file archiver
brew "parallel"                         # Shell tool for executing jobs in parallel
brew "pipx"                             # Install Python applications
brew "pngpaste"                         # Paste PNG into files
brew "pv"                               # Pipe viewer
brew "unzip"                            # Extraction utility
brew "wmctrl"                           # X window manipulation
brew "wordnet"                          # Lexical database for English
brew "wrk"                              # HTTP benchmarking tool
brew "wtfutil"                          # Personal information dashboard
brew "zenith"                           # System monitoring
brew "zip"                              # Compression utility

# --- Build Tools ---
brew "bazel"                            # Build and test software
brew "bison"                            # Parser generator
brew "pkgconf"                          # Package compiler and linker metadata
brew "libtool"                          # Generic library support script

# --- Libraries ---
brew "gmp"                              # GNU multiple precision arithmetic
brew "icu4c@76"                         # International Components for Unicode
brew "libyaml"                          # YAML parser and emitter
brew "openssl@1.1"                      # OpenSSL 1.1 (legacy)
brew "openssl@3"                        # OpenSSL 3
brew "pcre2"                            # Regular expression library
brew "portaudio"                        # Cross-platform audio I/O
brew "pyqt"                             # Python bindings for Qt
brew "qt"                               # Cross-platform framework
brew "re2"                              # Regular expression library
brew "unixodbc"                         # ODBC interface library
brew "wxwidgets"                        # Cross-platform C++ GUI toolkit
brew "xz"                               # General-purpose data compression

# --- Miscellaneous ---
brew "dockutil"                         # Manage macOS dock items
brew "fossil"                           # Distributed version control
brew "haproxy"                          # Reliable, high-performance TCP/HTTP load balancer
brew "kcat"                             # Kafka producer/consumer
brew "livekit"                          # WebRTC infrastructure
brew "the_silver_searcher"              # Code searching tool (ag)
brew "tiger-vnc"                        # VNC viewer
brew "uchardet"                         # Encoding detector
brew "crystal-ameba/ameba/ameba"        # Crystal code style linter
brew "node"                             # Node.js
brew "yarn"                             # JavaScript package manager

# ============================================================================
# CASKS (GUI Applications)
# ============================================================================

# --- Essential Tools ---
cask "1password-cli"                    # 1Password CLI

# --- Development ---
cask "dbeaver-community", args: { appdir: "/Applications" }
cask "insomnia", args: { appdir: "/Applications" }
cask "mongodb-compass"
cask "postman", args: { appdir: "/Applications" }
cask "sublime-text", args: { appdir: "/Applications" }

# --- Browsers ---
cask "firefox", args: { appdir: "/Applications" }

# --- Utilities ---
cask "alt-tab", args: { appdir: "/Applications" }
cask "handbrake-app", args: { appdir: "/Applications" }
cask "licecap", args: { appdir: "/Applications" }
cask "imcp"

# --- Fonts (Nerd Fonts for terminal/Emacs) ---
cask "font-fira-code-nerd-font", args: { appdir: "/Applications" }
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font", args: { appdir: "/Applications" }
cask "font-meslo-lg-nerd-font"                                      # Used in dotfiles
cask "font-roboto-mono-nerd-font", args: { appdir: "/Applications" }
cask "font-sauce-code-pro-nerd-font", args: { appdir: "/Applications" }
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font", args: { appdir: "/Applications" }
cask "font-ubuntu-nerd-font", args: { appdir: "/Applications" }

# --- Development Tools ---
cask "android-commandlinetools"
cask "basictex"                         # LaTeX distribution (for Emacs org-mode export)

# ============================================================================
# MAC APP STORE
# ============================================================================
mas "1Password for Safari", id: 1569813296
mas "Boop", id: 1518425043
mas "CopyClip", id: 595191960
mas "Enchanted", id: 6474268307
mas "Endel", id: 1346247457
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Sequel Ace", id: 1518036000
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835

# ============================================================================
# VSCODE EXTENSIONS
# ============================================================================
vscode "vscodevim.vim"

# ============================================================================
# GO PACKAGES
# ============================================================================
go "github.com/awslabs/amazon-ecr-credential-helper/ecr-login/cli/docker-credential-ecr-login"
go "github.com/jessfraz/dockfmt"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/x-motemen/gore/cmd/gore"
go "mvdan.cc/sh/v3/cmd/shfmt"
go "github.com/sqls-server/sqls"
go "github.com/gonejack/webarchive-to-html"

# ============================================================================
# CARGO (Rust) PACKAGES
# ============================================================================
cargo "cargo-edit"                      # Cargo extensions for editing Cargo.toml
cargo "emacs-lsp-booster"               # LSP performance booster for Emacs
cargo "mdopen"                          # Open markdown files
cargo "texlab"                          # LaTeX language server
cargo "xcp"                             # Extended cp command
